      *-----------------------------------------------------------------
       IDENTIFICATION DIVISION.
      *-----------------------------------------------------------------
       PROGRAM-ID.       PGMAUX02.
      *-----------------------------------------------------------------
      *  PROGRAMA      : PGMAUX02
      *  OBJETIVO      : ATUALIZAR O SALDO DA DIVIDA, SE NECESSARIO
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *-----------------------------------------------------------------
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

      *-----------------------------------------------------------------
       DATA DIVISION.
      *-----------------------------------------------------------------
       FILE SECTION.

      *-----------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *-----------------------------------------------------------------
      *01  WS-DADOS-RECEBIDOS.
      *    05 WS-TOTALDIVIDA               PIC 9(08)V99.
      *    05 WS-RESP                      PIC X(01).
      *    05 WS-DIVIDACALC                PIC 9(08)V99.

      *-----------------------------------------------------------------
       LINKAGE                             SECTION.
      *-----------------------------------------------------------------
       01  LS-DADOS-RECEBIDOS.
           05 LS-TOTALDIVIDA               PIC 9(08)V99.
           05 LS-RESP                      PIC X(01).
           05 LS-DIVIDACALC                PIC 9(08)V99.
      *-----------------------------------------------------------------
       PROCEDURE                           DIVISION USING
                                              LS-DADOS-RECEBIDOS.

           PERFORM 100-DIVIDACALC

           GOBACK
           .
      *-----------------------------------------------------------------
       100-DIVIDACALC.
      *-----------------------------------------------------------------
           MOVE 0                          TO LS-DIVIDACALC
           COMPUTE LS-DIVIDACALC = LS-TOTALDIVIDA * 1,1
           MOVE  '1'                       TO LS-RESP
           .
      *-----------------------------------------------------------------
